# Veri İndeksleme ve Seçimi

In [1]:
import pandas as pd

In [2]:
dizi=[[1,2],
      [3,4],
      [5,6],
      [7,8]]

In [3]:
df=pd.DataFrame(dizi,index=['a','b','c','d'],columns=['tek','çift'])

In [4]:
df

   tek  çift
a    1     2
b    3     4
c    5     6
d    7     8

In [5]:
df['tek']

a    1
b    3
c    5
d    7
Name: tek, dtype: int64

In [6]:
df['çift']

a    2
b    4
c    6
d    8
Name: çift, dtype: int64

In [7]:
df[['çift','tek']]
# istenilen sutünları , istenilen sıra ile yazılabilir
# df nesnesi ile karşılaştırdığımzda ,Çift sutünu , tek sutünu yer değiştirmiş gibi gözüküyor

   çift  tek
a     2    1
b     4    3
c     6    5
d     8    7

In [8]:
df.loc['a'] # satırlara erişmek için

tek     1
çift    2
Name: a, dtype: int64

In [9]:
df.loc['c']

tek     5
çift    6
Name: c, dtype: int64

In [10]:
df.loc['d','çift'] # 'd ' satırında , 'çift' sutünundaki elaman

8

In [11]:
df.loc['c','tek']

5

In [12]:
df.loc[['c','d'],['çift','tek']]

   çift  tek
c     6    5
d     8    7

----

In [13]:
df['toplam']=df['tek']+df['çift']

In [14]:
df

   tek  çift  toplam
a    1     2       3
b    3     4       7
c    5     6      11
d    7     8      15

In [15]:
df['toplam']

a     3
b     7
c    11
d    15
Name: toplam, dtype: int64

In [18]:
df.loc['a','toplam']

3

In [19]:
df.loc['a','toplam']=30

In [20]:
df

   tek  çift  toplam
a    1     2      30
b    3     4       7
c    5     6      11
d    7     8      15

In [21]:
df.loc['b']=500 # satır için

In [22]:
df

   tek  çift  toplam
a    1     2      30
b  500   500     500
c    5     6      11
d    7     8      15

In [23]:
df['tek']=0 # sutün için

In [24]:
df

   tek  çift  toplam
a    0     2      30
b    0   500     500
c    0     6      11
d    0     8      15